In [1]:
import sys
sys.path.insert(0, "./../")

In [2]:
from src import utils

In [3]:
import pandas as pd

In [4]:
raw_data = utils.open_json("./../data/qqq.json")

In [5]:
df = pd.DataFrame(raw_data['Time Series (Daily)']).T

In [6]:
df.head()

             1. open   2. high    3. low  4. close 5. volume
2023-12-15  404.1800  406.5399  403.5700  405.3400  62896645
2023-12-14  404.9800  406.3000  400.3400  403.3900  55447808
2023-12-13  399.6200  404.3600  398.8399  403.7400  55408129
2023-12-12  395.5600  398.7900  394.4100  398.6700  39221152
2023-12-11  391.7400  395.7900  391.5300  395.5200  41198021

In [7]:
numeric_cols = ["open", "high", "low", "close", "volume"]
df.columns = numeric_cols

In [8]:
for col in numeric_cols:
    df[col] = df[col].astype("float")

In [9]:
df.head()

              open      high       low   close      volume
2023-12-15  404.18  406.5399  403.5700  405.34  62896645.0
2023-12-14  404.98  406.3000  400.3400  403.39  55447808.0
2023-12-13  399.62  404.3600  398.8399  403.74  55408129.0
2023-12-12  395.56  398.7900  394.4100  398.67  39221152.0
2023-12-11  391.74  395.7900  391.5300  395.52  41198021.0

In [10]:
df = df.reset_index(names='date')

In [11]:
df.head()

         date    open      high       low   close      volume
0  2023-12-15  404.18  406.5399  403.5700  405.34  62896645.0
1  2023-12-14  404.98  406.3000  400.3400  403.39  55447808.0
2  2023-12-13  399.62  404.3600  398.8399  403.74  55408129.0
3  2023-12-12  395.56  398.7900  394.4100  398.67  39221152.0
4  2023-12-11  391.74  395.7900  391.5300  395.52  41198021.0

In [12]:
df.to_parquet("./../data/qqq.parquet")